---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreTreads
source: html/747e585d-f310-77c9-d722-3f67b335ef2b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreTreads Property

Can't create geometry for one or more treads.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateOneOrMoreTreads { get; }
```